# Названия и цены булок из Stellar Burgers
bun_names = ["Краторная булка N-200i", "Флюоресцентная булка R2-D3"]
bun_prices = [1255, 988]

# Соусы и их цены из Stellar Burgers
sauces = [
    ("Соус Spicy-X", 90),
    ("Соус фирменный Space Sauce", 80),
    ("Соус традиционный галактический", 15),
    ("Соус с шипами Антарианского плоскоходца", 88)
]


# Начинки и их цены из Stellar Burgers
fillings = [
    ("Мясо бессмертных моллюсков Protostomia", 1337),
    ("Говяжий метеорит", 3000),
    ("Биокотлета из марсианской Магнолии", 424),
    ("Филе Люминесцентного тетраодонтимформа", 988),
    ("Хрустящие минеральные кольца", 300),
    ("Плоды Фалленианского дерева", 874),
    ("Кристаллы марсианских альфа-сахаридов", 762),
    ("Мини-салат Экзо-Плантаго", 4400),
    ("Сыр с астероидной плесенью", 4142)
]


# Диапазоны цен для тестов
max_bun_price = 1255
min_bun_price = 988
max_filling_price = 4400
min_filling_price = 300
max_sauces_price = 90
min_sauces_price = 15